In [2]:
import numpy as np
import pandas as pd

In [2]:
# 数据拼接
ser1=pd.Series(['A','B','C'],index=[1,2,3])
ser2=pd.Series(['D','E','F'],index=[4,5,6])
print(pd.concat([ser1,ser2]))

1    A
2    B
3    C
4    D
5    E
6    F
dtype: object

In [5]:
df1=pd.DataFrame(np.arange(20).reshape(4,5),columns=list("abcde"))
df2=pd.DataFrame(np.arange(20).reshape(4,5),columns=list("cdefg"))
# print(pd.concat([df1,df2],axis=0))
# print(pd.concat([df1,df2],axis=1))
print(pd.concat([df1,df2],axis=0,join='inner'))#内连接
print(pd.concat([df1,df2],axis=0,ignore_index=True))#自动排序索引

    c   d   e
0   2   3   4
1   7   8   9
2  12  13  14
3  17  18  19
0   0   1   2
1   5   6   7
2  10  11  12
3  15  16  17
      a     b   c   d   e     f     g
0   0.0   1.0   2   3   4   NaN   NaN
1   5.0   6.0   7   8   9   NaN   NaN
2  10.0  11.0  12  13  14   NaN   NaN
3  15.0  16.0  17  18  19   NaN   NaN
4   NaN   NaN   0   1   2   3.0   4.0
5   NaN   NaN   5   6   7   8.0   9.0
6   NaN   NaN  10  11  12  13.0  14.0
7   NaN   NaN  15  16  17  18.0  19.0

In [11]:
# 数据连接merge
df1=pd.DataFrame({'cid':['001','002','003','004','005'],
                 'cname':['math','englih','python','R','excel']})
df2=pd.DataFrame({'cid':['001','005','004','005','004','005'],
                 'sname':['小李','小李','小王','小东','小东','小黑']})
print(pd.merge(df1,df2,on='cid',how='inner')) #默认内连接
print(pd.merge(df1,df2,on='cid',how='outer')) #外连接
print(pd.merge(df1,df2,on='cid',how='left')) #左连接
print(pd.merge(df1,df2,on='cid',how='right')) #右连接

   cid  cname sname
0  001   math    小李
1  004      R    小王
2  004      R    小东
3  005  excel    小李
4  005  excel    小东
5  005  excel    小黑
   cid   cname sname
0  001    math    小李
1  002  englih   NaN
2  003  python   NaN
3  004       R    小王
4  004       R    小东
5  005   excel    小李
6  005   excel    小东
7  005   excel    小黑
   cid   cname sname
0  001    math    小李
1  002  englih   NaN
2  003  python   NaN
3  004       R    小王
4  004       R    小东
5  005   excel    小李
6  005   excel    小东
7  005   excel    小黑
   cid  cname sname
0  001   math    小李
1  004      R    小王
2  004      R    小东
3  005  excel    小李
4  005  excel    小东
5  005  excel    小黑

In [12]:
df1=pd.DataFrame({'cid':['001','002','003','004','005'],
                 'cname':['math','englih','python','R','excel']})
df2=pd.DataFrame({'classid':['001','005','004','005','004','005'],
                 'sname':['小李','小李','小王','小东','小东','小黑']})

print(pd.merge(df1,df2,left_on='cid',right_on='classid',how='inner')) #默认内连接

   cid  cname classid sname
0  001   math     001    小李
1  004      R     004    小王
2  004      R     004    小东
3  005  excel     005    小李
4  005  excel     005    小东
5  005  excel     005    小黑

In [14]:
df1=pd.DataFrame({'cid':['001','002','003','004','005'],
                 'cname':['math','englih','python','R','excel']})
df2=pd.DataFrame({'classid':['001','005','004','005','004','005'],
                 'sname':['小李','小李','小王','小东','小东','小黑']})
df1=df1.set_index('cid')
print(pd.merge(df1,df2,left_index=True,right_on='classid',how='inner')) #默认内连接

   cname classid sname
0   math     001    小李
2      R     004    小王
4      R     004    小东
1  excel     005    小李
3  excel     005    小东
5  excel     005    小黑

In [6]:
# 去重
data=pd.DataFrame({"A":['a','b','c','c','c'],'B':[1,1,2,2,2],'C':[1,1,2,3,2]})
print(data)
# print(data.drop_duplicates(keep='first')) #删除第一次出现以外的重复数据
# print(data.drop_duplicates(keep='last'))#删除最后一次出现以外的重复数据
# print(data.drop_duplicates(subset=['A'],keep='first'))#删除最后一次出现以外的重复数据
# print(data.drop_duplicates(subset=['A','C'],keep='first'))#删除最后一次出现以外的重复数据

print(data.drop_duplicates(subset=['A'],keep='first',inplace=True))#修改原对象
print(data)

   A  B  C
0  a  1  1
1  b  1  1
2  c  2  2
3  c  2  3
4  c  2  2
None
   A  B  C
0  a  1  1
1  b  1  1
2  c  2  2

In [34]:
#group by分组

df=pd.DataFrame({'sid':list("ABCABC"),'money':range(6),'age':np.random.randint(20,30,6)})
# print(df)
# print(df.groupby('sid').sum())
# print(df.groupby('sid')['money'].sum())
# print(df['money'].groupby(df['sid']).sum())
print(df.groupby('sid')['age'].mean())

sid
A    26
B    28
C    26
Name: age, dtype: int32

In [41]:
# 男女性别比例
titan=pd.read_csv(r"F:\DataAnalysis\python\资料\全日制3班_20200507总结\数据分析课件\titanic_train.csv")
# print(titan.head(10))
# print(titan.groupby("Sex")["Survived"].sum())
# print(titan.groupby("Sex")["Survived"].count())
# rate=titan.groupby("Sex")["Survived"].sum()/titan.groupby("Sex")["Survived"].count()
# print(rate)
print(titan.groupby("Sex")["Survived"].mean())

Sex
female    0.742038
male      0.188908
Name: Survived, dtype: float64

In [43]:
print(titan.groupby(["Sex","Pclass"])["Survived"].mean())
titan.groupby(["Sex","Pclass"]).mean()

Sex     Pclass
female  1         0.968085
        2         0.921053
        3         0.500000
male    1         0.368852
        2         0.157407
        3         0.135447
Name: Survived, dtype: float64

               PassengerId  Survived        Age     SibSp     Parch  \
Sex    Pclass
female 1        469.212766  0.968085  34.611765  0.553191  0.457447
       2        443.105263  0.921053  28.722973  0.486842  0.605263
       3        399.729167  0.500000  21.750000  0.895833  0.798611
male   1        455.729508  0.368852  41.281386  0.311475  0.278689
       2        447.962963  0.157407  30.740707  0.342593  0.222222
       3        455.515850  0.135447  26.507589  0.498559  0.224784

                     Fare
Sex    Pclass
female 1       106.125798
       2        21.970121
       3        16.118810
male   1        67.226127
       2        19.741782
       3        12.661633

In [56]:
print(titan.pivot_table("Survived",index=["Sex","年龄划分"],columns="Pclass",aggfunc="mean"))
print(titan.pivot_table("Survived",index=["Sex","年龄划分"],columns="Pclass",aggfunc="sum"))

Pclass              1         2         3
Sex    年龄划分
female 小     0.931034  0.933333  0.514706
       中     0.978723  0.926829  0.333333
       老     1.000000  0.666667  1.000000
male   小     0.533333  0.270270  0.157143
       中     0.453125  0.075472  0.149533
       老     0.136364  0.111111  0.000000
Pclass        1   2   3
Sex    年龄划分
female 小     27  28  35
       中     46  38  11
       老      9   2   1
male   小      8  10  22
       中     29   4  16
       老      3   1   0

In [53]:
# 对数据进行分组
# titan['Age']
print(titan['Sex'].value_counts())
pct=pd.cut(titan['Age'],3)
# pct.value_counts()
pct=pd.cut(titan['Age'],5,labels=list('abcde'))
pct.value_counts()

male      577
female    314
Name: Sex, dtype: int64

b    346
c    188
a    100
d     69
e     11
Name: Age, dtype: int64

In [59]:
# titan['年龄划分']=pd.cut(titan['Age'],3,labels=['小','中','老'])
index=titan['年龄划分'].isna()
# titan[index]['Age']=np.mean(titan['Age'])
titan[index].loc[index,'Age']=0
titan

D:\Program Files\anaconda3\lib\site-packages\pandas\core\indexing.py:966: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self.obj[item] = s

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,年龄划分
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,小
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,中
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,小
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,中
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,中
...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S,中
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S,小
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S,NaN
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C,小
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q,中

In [61]:
factord=np.random.randint(0,10,10)
print(pd.cut(factord,3))
print(pd.cut(factord,3,labels=['a','b','c']))
print(pd.cut(factord,[-1,5,9]))

[(0.993, 3.333], (0.993, 3.333], (5.667, 8.0], (5.667, 8.0], (0.993, 3.333], (5.667, 8.0], (0.993, 3.333], (5.667, 8.0], (5.667, 8.0], (3.333, 5.667]]
Categories (3, interval[float64]): [(0.993, 3.333] < (3.333, 5.667] < (5.667, 8.0]]
[a, a, c, c, a, c, a, c, c, b]
Categories (3, object): [a < b < c]
[(-1, 5], (-1, 5], (5, 9], (5, 9], (-1, 5], (5, 9], (-1, 5], (5, 9], (5, 9], (-1, 5]]
Categories (2, interval[int64]): [(-1, 5] < (5, 9]]

In [66]:
fac=np.random.randint(0,100,100)
# qct=pd.qcut(fac,3)
# qct.value_counts()
print(pd.qcut(fac,3,labels=['a','b','c']))

[b, c, b, a, b, ..., b, a, a, a, a]
Length: 100
Categories (3, object): [a < b < c]

In [67]:
# 缺失值处理
data={'城市':['北京','上海','广州','深圳','沈阳'],
    '环比':[101.5,101.2,101.3,102.,100.1],
    '同比':[120.7,127.3,119.4,140.9,101.4],
    '定基':[121.4,127.8,122.0,145.5,101.6]}
df=pd.DataFrame(data)
df.dropna() #删除缺失值行
df.dropna(axis=1) #删除缺失值列
df.dropna(how='any') #any出现任意缺失值  all 所有缺失值
df.dropna(subset=["同比","定基"])#subset指定列进行缺失值检测

   城市     环比     同比     定基
0  北京  101.5  120.7  121.4
1  上海  101.2  127.3  127.8
2  广州  101.3  119.4  122.0
3  深圳  102.0  140.9  145.5
4  沈阳  100.1  101.4  101.6

In [70]:
# 填充缺失值
# print(df)
# print(df['同比'].fillna(0))#填充标量值
# print(df['同比'].fillna(method='ffill'))#填充向上
# print(df['同比'].fillna(method='bfill'))#填充标向下
# print(df.fillna({'同比':df['同比'].mean()})#对每个字段设置填充方法
df.loc[df['城市'].isna(),'城市']='未知'
df

   城市     环比     同比     定基
0  北京  101.5  120.7  121.4
1  上海  101.2  127.3  127.8
2  广州  101.3  119.4  122.0
3  深圳  102.0  140.9  145.5
4  沈阳  100.1  101.4  101.6

In [71]:
df.info

<bound method DataFrame.info of    城市     环比     同比     定基
0  北京  101.5  120.7  121.4
1  上海  101.2  127.3  127.8
2  广州  101.3  119.4  122.0
3  深圳  102.0  140.9  145.5
4  沈阳  100.1  101.4  101.6>

In [72]:
# 字符串向量化处理
string='q,b,c'
print(string.split(","))
ser=pd.Series(['a,b,c','d,e,f','h,i,j'],index=['A1',"A2","A3"])
print(ser)

['q', 'b', 'c']
A1    a,b,c
A2    d,e,f
A3    h,i,j
dtype: object

In [91]:
# titan
# print(titan['Name'])
# print(titan['Name'].str.len())
# print(titan['Name'].str.lower())
# print(titan['Name'].str.upper().head(5))
# print(titan['Name'].str.startswith("B").head(5))
# print(titan['Name'].str.endswith("s").head(5))
# print(titan['Name'].str.split(",").head(5))
titan['trip']='-----strip函数-----'
# titan.head(5)
# print(titan['trip'].str.strip("-").head(5))
# print(titan['Name'].str[:3].head(5))
# print(titan['Name'].str.get(1).head(5))#获取指定索引位置的元素

0    Bra
1    Cum
2    Hei
3    Fut
4    All
Name: Name, dtype: object
0    r
1    u
2    e
3    u
4    l
Name: Name, dtype: object

In [98]:
# 基于正则表达式字符串向量化方法
# print(titan['Name'].str.extract("(\w+)").head(5))
# print(titan['Name'].str.match("(\w+)").head(5))
# print(titan['Name'].str.replace("(\w+)","QQ").head(5))
# print(titan['Name'].str.count("(\w+)").head(5))
# print(titan['Name'].str.split("[,\s]").head(5))
print(titan['Name'].str.split("[,|\s+]").str.join(";").head(5))

0                              Braund;;Mr.;Owen;Harris
1    Cumings;;Mrs.;John;Bradley;(Florence;Briggs;Th...
2                               Heikkinen;;Miss.;Laina
3         Futrelle;;Mrs.;Jacques;Heath;(Lily;May;Peel)
4                             Allen;;Mr.;William;Henry
Name: Name, dtype: object

In [103]:
titan['Name'].map(lambda x:x.lower())
titan['Name'].map(lambda x:x[:3])
# num=[1,2,3,4,5]

# list(map(lambda x:x**2,num))

0      Bra
1      Cum
2      Hei
3      Fut
4      All
      ...
886    Mon
887    Gra
888    Joh
889    Beh
890    Doo
Name: Name, Length: 891, dtype: object

In [105]:
# titan.head()
def change(data):
    if data==0:
        return "未生还"
    else:
        return "生还"
titan['Survived'].map(change)

0      未生还
1       生还
2       生还
3       生还
4      未生还
      ...
886    未生还
887     生还
888    未生还
889     生还
890    未生还
Name: Survived, Length: 891, dtype: object

In [115]:
#apply函数
a=pd.DataFrame(np.arange(12).reshape(3,4),index=list("abc"),columns=list("ABCD"))
print(a)
# print(a.apply(sum))
# print(a.apply(np.mean))
# print(a.apply(sum,axis=1))
# print(a.apply(np.mean,axis=1))
def f(data):
#     print(data,type(data))
    return data["c"]-data["b"]
print(a.apply(f,axis=0))

   A  B   C   D
a  0  1   2   3
b  4  5   6   7
c  8  9  10  11
A    4
B    4
C    4
D    4
dtype: int64

In [130]:
np.random.seed(0)
df=pd.DataFrame(np.random.randint(0,100,50).reshape(10,5),columns=list("ABCDE"))
print(df)
def f(data):
    da=data.sort_values(ascending=False)
    print(da)
#     print(data.sort_values(ascending=False)[3])
    return da.iloc[2]-da.iloc[3]
print(df.apply(f,axis=0))

    A   B   C   D   E
0  44  47  64  67  67
1   9  83  21  36  87
2  70  88  88  12  58
3  65  39  87  46  88
4  81  37  25  77  72
5   9  20  80  69  79
6  47  64  82  99  88
7  49  29  19  19  14
8  39  32  65   9  57
9  32  31  74  23  35
4    81
2    70
3    65
7    49
6    47
0    44
8    39
9    32
5     9
1     9
Name: A, dtype: int32
2    88
1    83
6    64
0    47
3    39
4    37
8    32
9    31
7    29
5    20
Name: B, dtype: int32
2    88
3    87
6    82
5    80
9    74
8    65
0    64
4    25
1    21
7    19
Name: C, dtype: int32
6    99
4    77
5    69
0    67
3    46
1    36
9    23
7    19
2    12
8     9
Name: D, dtype: int32
6    88
3    88
1    87
5    79
4    72
0    67
2    58
8    57
9    35
7    14
Name: E, dtype: int32
A    16
B    17
C     2
D     2
E     8
dtype: int64

In [137]:
df=pd.read_excel(r"F:\DataAnalysis\python\资料\全日制3班_20200507总结\数据分析课件\排班原始表.xlsx")
print(df)
def f(data):
#     print(data)
    zb=(data=='早')
#     print(data.index[zb] )
    return pd.Series(list(data.index[zb]))
df.apply(f)

  Unnamed: 0  1  2  3  4  5  6  7  8  9 10 11 12
0         张三  早  休  早  早  休  早  早  休  早  早  休  早
1         李四  休  早  休  早  早  休  早  早  休  早  早  休
2         王五  正  正  休  休  正  正  正  正  正  早  早  正
3         刘七  早  早  早  休  早  休  早  早  休  休  早  早
4        赵老一  早  休  早  早  休  早  休  早  休  早  早  休
5         糊糊  休  早  休  早  早  休  早  早  休  早  休  早

<ipython-input-137-a3cca34293df>:7: DeprecationWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.
  return pd.Series(list(data.index[zb]))

   Unnamed: 0    1    2    3    4    5    6    7    8    9  10   11   12
0         NaN  0.0  1.0  0.0  0.0  1.0  0.0  0.0  1.0  0.0   0  1.0  0.0
1         NaN  3.0  3.0  3.0  1.0  3.0  4.0  1.0  3.0  NaN   1  2.0  3.0
2         NaN  4.0  5.0  4.0  4.0  5.0  NaN  3.0  4.0  NaN   2  3.0  5.0
3         NaN  NaN  NaN  NaN  5.0  NaN  NaN  5.0  5.0  NaN   4  4.0  NaN
4         NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   5  NaN  NaN